# Задание 4: Длинное выражение с backslash
# Напиши скрипт, который вычисляет результат сложного арифметического выражения:
# result = (10 + 5) * 2 - 8 / 4 + 3 ** 2
# Разбей это выражение на несколько строк, используя backslash для явного продолжения. Выведи результат в формате:
# Результат: <значение>

# Разбивка на части по заданию, для изучения backslash
result = (10 + 5) * 2 - \
         8 / 4 + 3 ** 2

print(f"Результат: {result}")  # Вывод результата
